# Определить также разность между минимальным y1  и максимальным y2  значением С
# Программа сделана Ву Минь Куанг группа ИУ7-14Б
# y1=9.45*h**4+5*h**3-4.37*h**2-0.28*h-0.35
# y2=(h-1)**2-0.5*e**h
# h=0.2(0.02)0.6
# Оператор FOR

from math import *

A = []
B = []
print(chr(9484),chr(9472) * 48,chr(9488))
print(chr(9474), 3*' ', 'x', 4*' ', chr(9474), 6*' ', 'y1', 6*' ', chr(9474),
      6*' ', 'y2', 6*' ', chr(9474))
print(chr(9500), chr(9472) * 48, chr(9508))
for h in range(20, 62, 2):
    a = 9.45 * (h * 10 ** -2) ** 4 + 5 * (h * 10 ** -2) ** 3 - 4.37 * (h * 10 ** -2) ** 2 - 0.28 * (h * 10 ** -2) - 0.35
    b = ((h * 10 ** -2) - 1) ** 2 - 0.5 * exp((h * 10 ** -2))
    A.append(a)
    B.append(b)

    print(chr(9474), '{:7.2f}'.format(h * 10 ** -2),2*' ', chr(9474), '{:12.5f}'.format(a),3*' ', chr(9474), '{:12.5f}'.format(b),3*' ', chr(9474))
print(chr(9492),chr(9472) * 48,chr(9496))
c = max(A)
d = min(B)
print('Максимальное значение функции y1: ', c)
print('Минимальное значение функции y2:  ', d)
print('разность между минимальным y1  и максимальным y2  значением: С= ', d / c)




print('\nПостроит Функцию 1')


j=int(input("Введите количество засечек j (от 4 до 8): "))
while ((j<4) or (j>8)):
    print("J должен быть от 4 до 8")
    j=int(input("Введите количество засечек j снова: "))
print("\n")
s=0                                                                                #Сумма значении функции
for h in range(20,61,2):
    h=round(h*10**-2,2)
    y1=9.45*h**4+5*h**3-4.37*h**2-0.28*h-0.35
    s+=y1
maxy1=miny1=round(s/((60-20)/2+1),2)                                               #Вычислить среднее значение
for h in range(20,61,2):
    h=round(h*10**-2,4)
    y1=9.45*h**4+5*h**3-4.37*h**2-0.28*h-0.35
    if y1>maxy1: maxy1=round(y1,2)
    if y1<miny1: miny1=round(y1,2)
d=(maxy1-miny1)/(j-1)                                                               #Шаг значения y1
print(" "*10,end="")
for k in range(0,j):                                                                #нарисовать ось Oy
    l=miny1+k*d                                                                     #Значения y на Oy
    if (abs(l)>=10**-6):
            print("{:5.2f}".format(l)," "*15,end=" ")
    else: print("{:6.2f}".format(l)," "*21,end=" ")
print(sep=" ")
print("     x "+" "*8,end="")
for k in range(0,j):
    print(chr(9524)+chr(9472)*20,end="")                                            #┴────────────────────
print(sep=" ")
vtymax=int(round(16+21*(j-1),0))                                                    #Положение максимального значения

vt0=int(round(((-miny1)/(maxy1-miny1))*(vtymax-16),0))
if vt0==0: vt0+=1
do=(maxy1-miny1)/(21*(j-1))                                                         #Значение пустого места
if ((miny1>0) or (maxy1<0)):
    for h in range(20,61,2):
        h=round(h*10**-2,2)
        y1=9.45*h**4+5*h**3-4.37*h**2-0.28*h-0.35
        x=(y1-miny1)/(maxy1-miny1)
        vty=int(x*(vtymax-16))                                                      #Определить место точки
        print("{:8.2f}".format(h)+7*" "+vty*" "+"*")                                #Рисовать точку
#Обратно:
else:
    for h in range(20,61,2):
        h=round(h*10**-2,2)
        y1=9.45*h**4+5*h**3-4.37*h**2-0.28*h-0.35
        x=(y1-miny1)/(maxy1-miny1)
        vty=int(round(x*(vtymax-16),0))                                             #Определить место точки
        if (y1<0):                                                                  #Точка лежит на слева Ox
            if (-y1)<do:                                                            #Точка принадлежает в пустом месте
                print("{:8.2f}".format(h)+chr(9474)+7*" "+(vt0)*" "+"*")
            else:                                                                   #Точка принадлежает в другом пустом месте
                print("{:8.2f}".format(h)+chr(9474)+7*" "+vty*" "+"*"+(vt0-vty-1)*" "+(chr(9474)))
        if (y1==10**-8):                                                            #Точка лежит на Ox
            print("{:8.2f}".format(h)+chr(9474)+7*" "+vty*" "+("*"))
        if (y1>0):                                                                  #Точка лежит на справа Ox
            if (y1<do):                                                             #Точка принадлежает в пустом месте
                print("{:8.2f}".format(h)+chr(9474)+7*" "+vt0*" "+"*")
            else:                                                                   #Точка принадлежает в другом пустом месте
                print("{:8.2f}".format(h)+chr(9474)+7*" "+vt0*" "+(chr(9474))+(vty-vt0-1)*" "+"*")

